<a href="https://colab.research.google.com/github/Abhi0508-ctr/Abhi_01/blob/master/Data_Manipulation_and_Visualization_using_Python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# About the Project

This project is more of a training module which helps you understand how data manipulation and visualization can be done on Python. It will take multiple smaller datasets or will create dataframes to teach important concepts that we use in common data manipulation and visualization.

The project will be focused around the use of Pandas and MatPlotLib libraries of Python programming. In a professional setting, you would work on larger datasets however, the same concepts are going to be applied on smaller datasets in this project.

# How to work on this project

Since it is more of a training module, you are required to read the concepts and concepts written and follow the instructions to answer the questions or get desired output.

Suggested resources and links are mentioned in the Notebook for certain concepts. You can open the links and read/watch the content to get an understanding of the concepts.

# Pandas in Python

Pandas is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series. 

When the values are in a table, the table in Python programming is called a dataframe. 
Basically, dataframes are nothing but variables with values in structured data format.

Pandas library is used to view, manipulate (modify) and analyse dataframes which are 2-D or 3-D in nature.

# Matplotlib in Python

Matplotlib is a plotting library in Python. It is used for creating static, animated, and interactive visualizations in Python.
In this project, we will use some modules of matplotlib library to create line, bar, column and pie charts with customized formatting to visualize certain data.

# Getting data imported to Python

Pandas ibrary supporting loading data from various online and offline sources to Python. It can fetch data from CSV, EXCEL, TEXT or from any website (URL) or servers as well. 

### 1. Import CSV files
It is important to note that a singlebackslash does not work when specifying the file path. You need to either change it to forward slash or add one more backslash like below

  import pandas as pd   # Here, pandas is library and pd is its alias name.

  mydata= pd.read_csv("C:\\Users\\AINE AI\\VIP\\filename.csv")

or

  import pandas as pd

  mydata= pd.read_csv("C:/Users/AINE AI/VIP/filename.csv")

### 2. Import File from URL
You don't need to perform additional steps to fetch data from URL. Simply put URL in read_csv() function (applicable only for CSV files stored in URL).
mydata = pd.read_csv("http://winterolympicsmedals.com/medals.csv")

### 3. Read Text File
We can use read_table() function to pull data from text file. We can also use read_csv() with sep= "\t" to read data from tab-separated file.

mydata = pd.read_table("C:/Users/AINE AI/VIP/filename.txt")

mydata = pd.read_csv("C:/Users/AINE AI/VIP/filename.txt", sep ="\t")

### 4. Read Excel File

The read_excel() function can be used to import excel data into Python.
mydata = pd.read_excel("https://www.eia.gov/dnav/pet/hist_xls/RBRTEd.xls",sheetname="Data 1", skiprows=2)

And many more functions to fetch data from different file types and sources.

Notice that all of the above mentioned functions (read_csv and read_table) had pd. before them. That means, those functions are part of pandas library and **pd** is an alias name for pandas.

### Datasets for this project are as below. Please download them all.
1. brics.csv : https://drive.google.com/file/d/1M5Cwbsg7_wCV1jIqx9r0Y3Iw7oEAH9n-/view?usp=sharing
2. cars.csv : https://drive.google.com/file/d/1jKBYa6NyEiBmaeXdfoYe3CxFGPT89Hr1/view?usp=sharing
3. marks.csv : https://drive.google.com/file/d/1U3DiTOcrhKI-5_jRttZqX4F1mup0QPZp/view?usp=sharing
4. mtcars.csv : https://drive.google.com/file/d/1Za1B2Nt_VuEDrSznS6PN5BM4c0pEOQm5/view?usp=sharing

### Adding comments in a Code cell

Comments are an excellent way to explain what we are doing in a code cell. Just add a hashtag sign (#) in front of the line/text you want to make as a comment.

1. Go to a line or select multiple lines in a Code Cell which you want to convert as comment.
2. Press Ctrl + /

In [ ]:
# Step 1: Run this code cell. It will show up as Syntax Error
# Step 2: Select these two lines, press Ctrl + / to make these as comments and then run the cell.

### Importing pandas library

There are different pandas functions used to import different file types. To use any of those functions, the first thing we need to do is to import pandas library. If you are using Google Colab or Jupyter Notebook on Anaconda Navigator, most probably it should alreay been installed. Hence, you need to just import pandas.

In [1]:
# TO DO: Import pandas library as an alias name (nickname) pd
# Syntax hint: import libraryname as aliasname
import pandas as pd

### If using Google Colab and data is on local disk

In this case, you need to first upload the file in file and use read_csv or read_excel functions to read the file as a dataframe.

In [ ]:
# Run this code first two upload the file. Make sure you have imported pandas in the previous code cell. Else, import here.

from google.colab import files
uploaded = files.upload()

Saving brics.csv to brics.csv

In [ ]:
# Coninuation of the previous code cell. 
'''
The io module provides Python's main facilities for dealing with various types of I/O. 
There are three main types of I/O: text I/O, binary I/O and raw I/O. 
'''

import io
brics = pd.read_csv(io.BytesIO(uploaded['brics.csv']))     # We are trying to work on brics.csv dataset
# Dataset is now stored in a Pandas Dataframe

brics   # Printing dataframe without the print() function.

  code       country  population      area    capital
0   BR        Brazil         200   8515767   Brasilia
1   RU        Russia         144  17098242     Moscow
2   IN         India        1252   3287590  New Delhi
3   CH         China        1357   9596961    Beijing
4   SA  South Africa          55   1221037   Pretoria

In [ ]:
# TO DO: Try printing the dataframe once using print() and once without print(). Do you observe any difference?

### If the data is uploaded on Jupyter Notebook and is saved in the same location where this Python Notebook is

Suppose your data and the Notebook are in the same location/folder in Jupyter Notebook, you can just 'read' the data without mentioning any directory/source path.

In [ ]:
# If the file is uploaded on Jupyter Notebook

brics = pd.read_csv("brics.csv")      # importing brics.csv dataset and converting the table into a dataframe (pandas table).

brics

### If data is in local system/disk.

If data is on local system and you want to import it in Jupyter Notebook, then use read_csv and the full-path of the file address.

In [ ]:
# Getting data from local location in our system.
brics = pd.read_csv("C:/Users/AINE AI/Downloads/brics.csv")  # Change this path as per your folder arrangements.

# Make sure the folder names are seperated by either a forward slash (/)or two backward slashes (\\) in the above code.

brics

In [ ]:
# Data type of any variable can be seen using the function type()

print(type(5))
print(type('a text'))
print(type(True))
print(type(df))         # datatype of the dataframe created above

<class 'int'>
<class 'str'>
<class 'bool'>
<class 'pandas.core.frame.DataFrame'>

### Explore the dataframe

Intial exploration should be done on any dataset to understand the variables/columns, values, data types and the structure of the data.

In [ ]:
'''
The info() function is used to print a concise summary of a DataFrame. 
This method prints information about a DataFrame including the index dtype and column dtypes, 
non-null values and memory usage.
'''
brics.info()

# Object dtype can store variables with any or mixed data types

#### ! Resources

The best thing about Python is that the concepts, functions, libraries - all are well documented and queries related to almost everything can be found on many reliable sources. 

To learn about the functions in pandas library, you can refer to this page:
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dtypes.html

If you are a beginner in Python and dataframes, https://www.w3schools.com/python/ can be a great resource for you.

In [ ]:
#value_counts() function returns object containing counts of unique values. 
#The resulting object will be in descending order so that the first element is the most frequently-occurring element. 
#Excludes NA values by default.

# TO DO: use value_counts() in the brics dataframe to explore the data.

In [ ]:
# When the dataset is large and you want to sort the data by ascending or descending order to look at largest or smallest values.

# Ascending order by column code. Uncomment the lines to run them.
# brics.sort_values(by=['code'])   # Ascending by default.
# or
# brics.sort_values(by=['code'], ascending = True)  # No need to mention

  code       country  population      area    capital
4   SA  South Africa          55   1221037   Pretoria
1   RU        Russia         144  17098242     Moscow
2   IN         India        1252   3287590  New Delhi
3   CH         China        1357   9596961    Beijing
0   BR        Brazil         200   8515767   Brasilia

In [ ]:
# Sorting in descending order.
brics.sort_values(by=['code'], ascending = False)

In [ ]:
# TO DO: Do you think sorting the data changes the data in original dataframe? 
# print the dataframe and observe the output to get the answer.

In [ ]:
# TO DO: Sort the data to see which country has largest population ( population is in millions).

In [ ]:
# TO DO: Sort the data to see which country is smallest in size.

In [ ]:
# Sorting and printing just one column.

brics.country.sort_values(ascending=False)

In [ ]:
# TO DO: Sort and print area column on from largest to smallest.

# Indexing in dataframes

Notice that when you print a dataframe, a column with numbers 0, 1, 2... shows up at the left side. This column is called Index column. An index column indicates the position/row of records.


![image.png]()

If our data contains a column with unique values such as StudentID, EmployeeID, OrderID etc., we can make that specific column (with unique values) as our index column.

In this case, we can make code column or even country column as index column.

In [ ]:
# Indices can be used to fetch data from a particular row. 
# Example, to fetch data from the 2nd row, we can use index 1 (one)
brics.country[1]

# We will work more on the index column later.

In [ ]:
# Getting single column from a dataframe

print(brics["country"])

code
BR          Brazil
RU          Russia
IN           India
CH           China
SA    South Africa
Name: country, dtype: object

In [ ]:
# TO DO: Print area column from brics dataframe

In [ ]:
# Other way to get a single column from a dataframe - use dot

brics.country

In [ ]:
# TO DO:  Print code column from the dataframe using dot

In [ ]:
# Pritning multiple columns
brics[['country', 'capital']]

In [ ]:
# TO DO: Print country, capital and population

##### Do you think we should use square bracket to print one column a dataframe or dot?

If you think we can use both methods in all cases, you would be wrong.

To check this and understand the issue of using dot everywhere, please create a new code cell, copy-paste the below code in it and try to observe the issue.

import pandas as pd

df = pd.DataFrame({'name': ['Niko', 'Penelope', 'Aria'],
                   'average score': [10, 5, 3],
                   'max': [99, 100, 3]})
                   
df.average score

If you get error, try printing the same colum using square bracket.

In [ ]:
# use col 0 as index. 
# This will remove the 1st column containing the index or sl. no. from the above output, 
# and make the 1st column from actual data as the index.

brics = pd.read_csv("brics.csv",index_col=0)
brics

# Note that the 'code' will be used as Index only and not as a part of data anymore.

# Transforming the dataframe

In [ ]:
#Adding a new column to the existing Data Frame
brics["on_earth"] = [True, True, True, True, True]    

# We are adding a list here. Read more on lists: https://www.w3schools.com/python/python_lists.asp

brics

In [ ]:
# adding a calculated column
brics["density"] = brics["population"] / brics["area"] * 1000000   # per km sq.
brics

Removing the additional decimal points or setting the precision can be done on the entire dataframe.

In [ ]:
brics.style.set_precision(2)  # Upto 2 decimal points for all float columns in the dataframe. 

# This WILL NOT change the original dataframe i.e. the original dataframe will still have multiple digits after decimals.

In [ ]:
brics["density"].round(2) # Rounding of individual column to fixed decimal points.

# Fetching data using indices and location functions (.loc and .iloc)

To Note:
1. .loc is used with the actual value/label of the index
2. .iloc is used with the index position/reference - which are numbers (0, 1, 2, 3, 4......)

Look at the below code cells to understand the difference.

In [ ]:
# Before starting, let's first print the brics daraframe. Can you please do this?


# Notice that the indices are BR, RU, IN, CH and SA. However, their position (numerical index) are 0, 1, 2, 3 and 4.

In [ ]:
brics.loc["SA"]     # .loc is used with actual value of the index. 
# The value mentioned in the argument must be there in the dataframe's index list.

In [ ]:
brics.iloc[4]  # .loc is used when we are giving the index reference as number, not the actual value of the index.

In [ ]:
# TO DO: Use .loc to print the values from all columns for IN

In [ ]:
# TO DO: Use .iloc to print the values from all columns from 3rd row (index number will be 1 less than the row number).

# Adding rows in the dataframe

append() is used to add records in a dataframe or even in lists.

In [ ]:
#ading a new ROW using append
newrow = {'code':'WK', 'country':'Wakanda', 'population':5,'area':1000000,'capital':'Wakanda City','on_earth':False,'density':5}
brics1 = brics.append(newrow,ignore_index=True)   # Ignoring the existing index.
# Ignoring the existing index will result into new dataframe index 0,1,2,....

'''
Why there is NaN for code in other rows?  
Because the previous 'code' was not a part of datatable. It was an index.
With 'code' in 'newrow', we are adding a new column called 'code'
'''

'''
ignore_index=False will result into error because 'newrow' is a dictionary
and appending a dictionary into a dataframe will not work if we do not ignore the index.
'''
brics1   # append will not result into chaning the actual dataframe. brics will still be the same

        country  population      area       capital  on_earth     density code
0        Brazil         200   8515767      Brasilia      True   23.485847  NaN
1        Russia         144  17098242        Moscow      True    8.421918  NaN
2         India        1252   3287590     New Delhi      True  380.826076  NaN
3         China        1357   9596961       Beijing      True  141.398928  NaN
4  South Africa          55   1221037      Pretoria      True   45.043680  NaN
5       Wakanda           5   1000000  Wakanda City     False    5.000000   WK

In [ ]:
#Adding a new row using .loc
brics.loc['WK'] = ['Wakanda', 5, 1000000, 'Wakanda City', False, 5]   
# Sequence is very important. Data types may get changed due to wrong sequence.
brics

           country  population      area       capital  on_earth     density
code
BR          Brazil         200   8515767      Brasilia      True   23.485847
RU          Russia         144  17098242        Moscow      True    8.421918
IN           India        1252   3287590     New Delhi      True  380.826076
CH           China        1357   9596961       Beijing      True  141.398928
SA    South Africa          55   1221037      Pretoria      True   45.043680
WK         Wakanda           5   1000000  Wakanda City     False    5.000000

In [ ]:
# TO DO: Add a new row in the dataframe using .loc any other country with some values in all columns.

In [ ]:
# Fetching the value in 2-D way. In Excel, we have cells for that, Ex- A2 means column A and row 2.
# All of the below codes will give the same output. Please uncomment and execute them one by one.

# brics.loc["IN","capital"]

# brics["capital"].loc["IN"]

# brics.loc["IN"]['capital']

#### Deleting rows and columns from a dataframe using drop()

In [ ]:
# Lets create a new dataframe so that brics is not affected.

brics1 = brics
brics1

In [ ]:
brics1.drop(['area'], axis=1)  # axis = 0 by default for rows. Axis = 1 for column.

# For multiple columns, mention the columns separated by comma. Ex. df.drop(['name','max'], axis=1)

           country  population       capital  on_earth     density
code
BR          Brazil         200      Brasilia      True   23.485847
RU          Russia         144        Moscow      True    8.421918
IN           India        1252     New Delhi      True  380.826076
CH           China        1357       Beijing      True  141.398928
SA    South Africa          55      Pretoria      True   45.043680
WK         Wakanda           5  Wakanda City     False    5.000000

In [ ]:
brics1 = brics

# TO DO: Try deleting area and density columns from brics1 dataframe

In [ ]:
# TO DO: Delete the record for Wakanda by using its index WK
# Hint: Use WK as identifier and delete axis argument or put axis = 0

In [ ]:
brics1 = brics

# Another way to drop columns
brics1.drop(columns=['area', 'density'])

In [ ]:
brics1 = brics

# Drop rows by index

brics1.drop(['IN', 'CH'])

In [ ]:
# The shape function helps us to find the shape or size of an array or matrix. In Excel - A1:D10.  
# shape[0] means we are working along the first dimension of your array.
# If Y has n rows and m columns, then Y.shape is (n,m). So Y.shape[0] is n.

for index in range(brics.shape[0]):    
    countryName = brics.iloc[index,0]  # row - index, column - 0
    cityName = brics.iloc[index, 3]  # row - index, column - 3
    print('The Capital City of', countryName, 'is', cityName)

Read more on shape() : https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.shape.html

In [ ]:
#Another solution
for index in range(brics.shape[0]):
    print('The Capital City of', brics.iloc[index, 0], 'is', brics.iloc[index, 3])

In [ ]:
#Another solution
# iterrows() is a generator that iterates over the rows of the dataframe and returns the index of each row, 
# in addition to an object containing the row itself.

for index, row in brics.iterrows():
    print("The Capital City of",row['country'],"is", row['capital'])

# Importing data from an url

We will explore some more data exploration functions on a different dataset. 

Date to use: cars.csv : https://drive.google.com/file/d/1jKBYa6NyEiBmaeXdfoYe3CxFGPT89Hr1/view?usp=sharing

In [1]:
# If data is in Google Drive
import pandas as pd
from google.colab import files
uploaded = files.upload()

Saving cars.csv to cars.csv

In [2]:
# Coninuation of the previous code cell. 
'''
The io module provides Python's main facilities for dealing with various types of I/O. 
There are three main types of I/O: text I/O, binary I/O and raw I/O. 
'''

import io
cars = pd.read_csv(io.BytesIO(uploaded['cars.csv']))
# Dataset is now stored in a Pandas Dataframe

cars

  Unnamed: 0  cars_per_cap        country  drives_right
0         US           809  United States          True
1        AUS           731      Australia         False
2        JAP           588          Japan         False
3         IN            18          India         False
4         RU           200         Russia          True
5        MOR            70        Morocco          True
6         EG            45          Egypt          True

Notice that there is an unnamed column in the above output. It is because the column name is not given in the orignal dataset for the 1st column. We will make corrections for that in sometime.

In [3]:
# Print top 5 rows from the data, without any sorting or filter.
cars.head(5)

  Unnamed: 0  cars_per_cap        country  drives_right
0         US           809  United States          True
1        AUS           731      Australia         False
2        JAP           588          Japan         False
3         IN            18          India         False
4         RU           200         Russia          True

In [4]:
# TO DO: Print top 7 rows from the data
# To print n number of rows, enter the value of n in the head() as an argument.
cars.head(7)

  Unnamed: 0  cars_per_cap        country  drives_right
0         US           809  United States          True
1        AUS           731      Australia         False
2        JAP           588          Japan         False
3         IN            18          India         False
4         RU           200         Russia          True
5        MOR            70        Morocco          True
6         EG            45          Egypt          True

In [5]:
# For bottom 5 rows in the dataframe
cars.tail(5)

  Unnamed: 0  cars_per_cap  country  drives_right
2        JAP           588    Japan         False
3         IN            18    India         False
4         RU           200   Russia          True
5        MOR            70  Morocco          True
6         EG            45    Egypt          True

In [6]:
# TO DO: Print last 10 rows from the dataframe
cars.tail(10)

  Unnamed: 0  cars_per_cap        country  drives_right
0         US           809  United States          True
1        AUS           731      Australia         False
2        JAP           588          Japan         False
3         IN            18          India         False
4         RU           200         Russia          True
5        MOR            70        Morocco          True
6         EG            45          Egypt          True

We will use inplace argument whcih decide if the changes should be made in the original dataframe or not.

Read more here: https://jman4190.medium.com/explaining-the-inplace-parameter-for-beginners-5de7ffa18d2e

In [7]:
# Giving a name to the unnamed column

print(cars)

df1 = cars.rename( columns={'Unnamed: 0':'code'}, inplace=False ) 
cars.rename( columns={'Unnamed: 0':'code'}, inplace=True ) 

print(df1)
print(cars)      # With False, there will be no change in cars dataframe.



'''
inplace = True has been used to overwrite the existing dataframe. The default is False, if nothing mentioned.
When inplace = True , the data is modified in place, which means it will return nothing 
and the dataframe is now updated. 
When inplace = False , which is the default, 
then the operation is performed and it returns a copy of the object. You then need to save it to something.'''

  Unnamed: 0  cars_per_cap        country  drives_right
0         US           809  United States          True
1        AUS           731      Australia         False
2        JAP           588          Japan         False
3         IN            18          India         False
4         RU           200         Russia          True
5        MOR            70        Morocco          True
6         EG            45          Egypt          True
  code  cars_per_cap        country  drives_right
0   US           809  United States          True
1  AUS           731      Australia         False
2  JAP           588          Japan         False
3   IN            18          India         False
4   RU           200         Russia          True
5  MOR            70        Morocco          True
6   EG            45          Egypt          True
  code  cars_per_cap        country  drives_right
0   US           809  United States          True
1  AUS           731      Australia         False
2  JAP           588          Japan         False
3   IN            18          India         False
4   RU           200         Russia          True
5  MOR            70        Morocco          True
6   EG            45          Egypt          True

'\ninplace = True has been used to overwrite the existing dataframe. The default is False, if nothing mentioned.\nWhen inplace = True , the data is modified in place, which means it will return nothing \nand the dataframe is now updated. \nWhen inplace = False , which is the default, \nthen the operation is performed and it returns a copy of the object. You then need to save it to something.'

In [9]:
print(cars['cars_per_cap'])  # without column name at the top. Prints data and detail

0    809
1    731
2    588
3     18
4    200
5     70
6     45
Name: cars_per_cap, dtype: int64

In [8]:
print(cars[['cars_per_cap']])  # print the actual data

   cars_per_cap
0           809
1           731
2           588
3            18
4           200
5            70
6            45

In [10]:
# TO DO: Read the data again and set the 1st column as the index column. Then, print the cars dataframe.
cars = pd.read_csv(io.BytesIO(uploaded['cars.csv']),index_col=0)
cars

     cars_per_cap        country  drives_right
US            809  United States          True
AUS           731      Australia         False
JAP           588          Japan         False
IN             18          India         False
RU            200         Russia          True
MOR            70        Morocco          True
EG             45          Egypt          True

In [11]:
# TO DO : Print the details of RU
# Hint: You should use either .loc or .iloc (just one is correct).
cars.loc["RU"]

cars_per_cap       200
country         Russia
drives_right      True
Name: RU, dtype: object

In [12]:
# TO DO: Can you change the above answer to show the column name at the top? 
# Hint: Recap last 3-4 code cells.
cars.loc[["RU"]]

    cars_per_cap country  drives_right
RU           200  Russia          True

In [13]:
# TO DO: Print all details for RU and AUS from cars dataframe.
cars.loc[['RU','AUS']]

     cars_per_cap    country  drives_right
RU            200     Russia          True
AUS           731  Australia         False

In [15]:
# Print the Cars Per Capita (cars_per_cap) for India (IN).
cars["cars_per_cap"].loc["IN"]

18

In [17]:
# Print the Cars Per Capita (cars_per_cap) for India (IN) and Russia (RU).
cars["cars_per_cap"].loc[["IN","RU"]]

IN     18
RU    200
Name: cars_per_cap, dtype: int64

In [ ]:
# Print the Cars Per Capita and Country name for India and Russia

# Pandas Advanced and Matplotlib

Dateset to use: marks.csv : https://drive.google.com/file/d/1U3DiTOcrhKI-5_jRttZqX4F1mup0QPZp/view?usp=sharing

In [18]:
# If data is in Google Drive
import pandas as pd
from google.colab import files
uploaded = files.upload()

Saving marks.csv to marks.csv

In [19]:
# Coninuation of the previous code cell. 
'''
The io module provides Python's main facilities for dealing with various types of I/O. 
There are three main types of I/O: text I/O, binary I/O and raw I/O. 
'''

import io
marks = pd.read_csv(io.BytesIO(uploaded['marks.csv']))
# Dataset is now stored in a Pandas Dataframe

marks

   Student_ID Student_Name    English  ...    Science    History  Social_Studies
0         S01        Alice  96.874050  ...  58.682033  59.690510       61.373070
1         S02          Bob   5.462131  ...  83.171957  45.664012       80.805730
2         S03      Charlie  60.753099  ...  99.323628  24.281512       58.057612
3         S04        David  21.160844  ...  35.860852  62.865185       95.264572
4         S05       Edward  63.250994  ...   7.020915  60.505272       34.041671
5         S06        Fysal  42.694748  ...  37.216613  33.784399       85.019761
6         S07       George  66.276626  ...  14.219533  18.582771       87.021849
7         S08       Hareez   5.302984  ...  43.980951  54.410098       74.530018
8         S09         Ivan   5.777530  ...  94.559212  38.355867       90.483635
9         S10         John  30.968731  ...   3.312853  79.916094       32.706891
10        S11       Kelvin  40.219985  ...  16.826141   7.462064       34.449110
11        S12          Lia  95.928421  ...  95.440164  43.520213       71.930382
12        S13        Maria   8.215446  ...  16.518147  36.543154       80.665074
13        S14         Noel  72.833673  ...  22.089014  52.867757       20.583259
14        S15       Oliver   5.982402  ...  40.977224  80.925749       83.312063
15        S16        Peter  40.694327  ...   8.149884  13.852098       74.528425
16        S17          Roy  43.559963  ...  13.924531  71.306738        8.432155
17        S18          Ria  30.830802  ...  84.271650  78.727155        7.305670
18        S19        Suvin  72.218179  ...  32.555060  47.007177       83.344403
19        S20          Tan  18.070264  ...   2.618987  14.067349       82.802787

[20 rows x 7 columns]

In [24]:
# If working on Jupyter Notebook and data is in local drive
marks = pd.read_csv("C:/Users/AINE AI/Downloads/brics.csv")

FileNotFoundError: ignored

In [26]:
# TO DO: Show the shape of the dataframe
# Hint: shape()
marks.shape

(20, 7)

In [27]:
# TO DO: Get the information and structure of the data with non-null value counts
marks.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Student_ID      20 non-null     object
 1   Student_Name    20 non-null     object
 2   English         20 non-null     float64
 3   Maths           20 non-null     float64
 4   Science         20 non-null     float64
 5   History         20 non-null     float64
 6   Social_Studies  20 non-null     float64
dtypes: float64(5), object(2)
memory usage: 1.2+ KB

In [31]:
# Print datatypes of the each column
print(type("Student_ID"))
print(type('Student_Name'))
print(type('English'))
print(type("Maths"))
print(type('Science'))
print(type('History'))
print(type('Social_Studies'))

<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>
<class 'str'>

Note: The output that you see is for the values in the column, not for the column iteself. A column of a dataframe is called a SERIES. The type of a series is Series.

Run the next code code and observe the output to get more clarity.

In [30]:
print(type(marks))
print(type(marks.English))  # Column's dtype is Series, the dtype of the values is Object.
print(type(5))
print(type(5.5))
print(type("Python"))
print(type(True))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
<class 'int'>
<class 'float'>
<class 'str'>
<class 'bool'>

#### display() Vs print()

display() is similar to print() with some difference. 

Useful in advanced Python when you can 'display' images, but not 'print' them.

When working on a dataframe, prefer to use display()

In [35]:
# Run these lines one by one and observe the difference in the three outputs.

print(marks)
display(marks) 
marks

   Student_ID Student_Name    English  ...    Science    History  Social_Studies
0         S01        Alice  96.874050  ...  58.682033  59.690510       61.373070
1         S02          Bob   5.462131  ...  83.171957  45.664012       80.805730
2         S03      Charlie  60.753099  ...  99.323628  24.281512       58.057612
3         S04        David  21.160844  ...  35.860852  62.865185       95.264572
4         S05       Edward  63.250994  ...   7.020915  60.505272       34.041671
5         S06        Fysal  42.694748  ...  37.216613  33.784399       85.019761
6         S07       George  66.276626  ...  14.219533  18.582771       87.021849
7         S08       Hareez   5.302984  ...  43.980951  54.410098       74.530018
8         S09         Ivan   5.777530  ...  94.559212  38.355867       90.483635
9         S10         John  30.968731  ...   3.312853  79.916094       32.706891
10        S11       Kelvin  40.219985  ...  16.826141   7.462064       34.449110
11        S12          Lia  95.928421  ...  95.440164  43.520213       71.930382
12        S13        Maria   8.215446  ...  16.518147  36.543154       80.665074
13        S14         Noel  72.833673  ...  22.089014  52.867757       20.583259
14        S15       Oliver   5.982402  ...  40.977224  80.925749       83.312063
15        S16        Peter  40.694327  ...   8.149884  13.852098       74.528425
16        S17          Roy  43.559963  ...  13.924531  71.306738        8.432155
17        S18          Ria  30.830802  ...  84.271650  78.727155        7.305670
18        S19        Suvin  72.218179  ...  32.555060  47.007177       83.344403
19        S20          Tan  18.070264  ...   2.618987  14.067349       82.802787

[20 rows x 7 columns]

   Student_ID Student_Name    English  ...    Science    History  Social_Studies
0         S01        Alice  96.874050  ...  58.682033  59.690510       61.373070
1         S02          Bob   5.462131  ...  83.171957  45.664012       80.805730
2         S03      Charlie  60.753099  ...  99.323628  24.281512       58.057612
3         S04        David  21.160844  ...  35.860852  62.865185       95.264572
4         S05       Edward  63.250994  ...   7.020915  60.505272       34.041671
5         S06        Fysal  42.694748  ...  37.216613  33.784399       85.019761
6         S07       George  66.276626  ...  14.219533  18.582771       87.021849
7         S08       Hareez   5.302984  ...  43.980951  54.410098       74.530018
8         S09         Ivan   5.777530  ...  94.559212  38.355867       90.483635
9         S10         John  30.968731  ...   3.312853  79.916094       32.706891
10        S11       Kelvin  40.219985  ...  16.826141   7.462064       34.449110
11        S12          Lia  95.928421  ...  95.440164  43.520213       71.930382
12        S13        Maria   8.215446  ...  16.518147  36.543154       80.665074
13        S14         Noel  72.833673  ...  22.089014  52.867757       20.583259
14        S15       Oliver   5.982402  ...  40.977224  80.925749       83.312063
15        S16        Peter  40.694327  ...   8.149884  13.852098       74.528425
16        S17          Roy  43.559963  ...  13.924531  71.306738        8.432155
17        S18          Ria  30.830802  ...  84.271650  78.727155        7.305670
18        S19        Suvin  72.218179  ...  32.555060  47.007177       83.344403
19        S20          Tan  18.070264  ...   2.618987  14.067349       82.802787

[20 rows x 7 columns]

   Student_ID Student_Name    English  ...    Science    History  Social_Studies
0         S01        Alice  96.874050  ...  58.682033  59.690510       61.373070
1         S02          Bob   5.462131  ...  83.171957  45.664012       80.805730
2         S03      Charlie  60.753099  ...  99.323628  24.281512       58.057612
3         S04        David  21.160844  ...  35.860852  62.865185       95.264572
4         S05       Edward  63.250994  ...   7.020915  60.505272       34.041671
5         S06        Fysal  42.694748  ...  37.216613  33.784399       85.019761
6         S07       George  66.276626  ...  14.219533  18.582771       87.021849
7         S08       Hareez   5.302984  ...  43.980951  54.410098       74.530018
8         S09         Ivan   5.777530  ...  94.559212  38.355867       90.483635
9         S10         John  30.968731  ...   3.312853  79.916094       32.706891
10        S11       Kelvin  40.219985  ...  16.826141   7.462064       34.449110
11        S12          Lia  95.928421  ...  95.440164  43.520213       71.930382
12        S13        Maria   8.215446  ...  16.518147  36.543154       80.665074
13        S14         Noel  72.833673  ...  22.089014  52.867757       20.583259
14        S15       Oliver   5.982402  ...  40.977224  80.925749       83.312063
15        S16        Peter  40.694327  ...   8.149884  13.852098       74.528425
16        S17          Roy  43.559963  ...  13.924531  71.306738        8.432155
17        S18          Ria  30.830802  ...  84.271650  78.727155        7.305670
18        S19        Suvin  72.218179  ...  32.555060  47.007177       83.344403
19        S20          Tan  18.070264  ...   2.618987  14.067349       82.802787

[20 rows x 7 columns]

### Using range and multiple values in .loc and .iloc

Do you know the difference between = and == ?

In [36]:
num = 5 # Assignment. No output of assignment operator. 
num

num == 6 # Comparison/equality. Output is either True or False

False

Using different logical operator to explore or fetch certain details from a large dataset.

In [37]:
# selecting marks for 'Ria'
display(marks.loc[(marks.Student_Name == 'Ria')])  # in case the index is not known for large datasets

   Student_ID Student_Name    English  ...   Science    History  Social_Studies
17        S18          Ria  30.830802  ...  84.27165  78.727155         7.30567

[1 rows x 7 columns]

In [38]:
# TO DO: Print all records for David
display(marks.loc[(marks.Student_Name == 'David')])

  Student_ID Student_Name    English  ...    Science    History  Social_Studies
3        S04        David  21.160844  ...  35.860852  62.865185       95.264572

[1 rows x 7 columns]

In [39]:
# Using OR operator to print details if the name is either 'Ria' OR 'David'
display(marks.loc[(marks.Student_Name == 'Ria') | (marks.Student_Name == 'David')])

   Student_ID Student_Name    English  ...    Science    History  Social_Studies
3         S04        David  21.160844  ...  35.860852  62.865185       95.264572
17        S18          Ria  30.830802  ...  84.271650  78.727155        7.305670

[2 rows x 7 columns]

In [41]:
# TO DO: Print all records is the Student IS is either S05 or S10
display(marks.loc[(marks.Student_ID == 'S05') | (marks.Student_ID == 'S10')])

  Student_ID Student_Name    English  ...   Science    History  Social_Studies
4        S05       Edward  63.250994  ...  7.020915  60.505272       34.041671
9        S10         John  30.968731  ...  3.312853  79.916094       32.706891

[2 rows x 7 columns]

In [43]:
# TO DO: Fetch all details where marks in English > 70 or marks in Maths > 70.
display(marks.loc[(marks.English > 70) | (marks.Maths > 70)])

   Student_ID Student_Name    English  ...    Science    History  Social_Studies
0         S01        Alice  96.874050  ...  58.682033  59.690510       61.373070
1         S02          Bob   5.462131  ...  83.171957  45.664012       80.805730
3         S04        David  21.160844  ...  35.860852  62.865185       95.264572
5         S06        Fysal  42.694748  ...  37.216613  33.784399       85.019761
8         S09         Ivan   5.777530  ...  94.559212  38.355867       90.483635
11        S12          Lia  95.928421  ...  95.440164  43.520213       71.930382
13        S14         Noel  72.833673  ...  22.089014  52.867757       20.583259
15        S16        Peter  40.694327  ...   8.149884  13.852098       74.528425
16        S17          Roy  43.559963  ...  13.924531  71.306738        8.432155
18        S19        Suvin  72.218179  ...  32.555060  47.007177       83.344403

[10 rows x 7 columns]

In [44]:
# Using AND operator to combine two conditions. 

# TO DO: Fetch all details where marks in English > 70 AND marks in Maths > 70.
# Hint: Use & for AND
display(marks.loc[(marks.English > 70) & (marks.Maths > 70)])

   Student_ID Student_Name    English  ...   Science    History  Social_Studies
18        S19        Suvin  72.218179  ...  32.55506  47.007177       83.344403

[1 rows x 7 columns]

In [45]:
# Using NOT function 

# TO DO: Fetch all details for all students except for Ria or the all students who are not Ria.
# Hint: Use != for 'not equal to'
display(marks.loc[(marks.Student_Name != 'Ria')])

   Student_ID Student_Name    English  ...    Science    History  Social_Studies
0         S01        Alice  96.874050  ...  58.682033  59.690510       61.373070
1         S02          Bob   5.462131  ...  83.171957  45.664012       80.805730
2         S03      Charlie  60.753099  ...  99.323628  24.281512       58.057612
3         S04        David  21.160844  ...  35.860852  62.865185       95.264572
4         S05       Edward  63.250994  ...   7.020915  60.505272       34.041671
5         S06        Fysal  42.694748  ...  37.216613  33.784399       85.019761
6         S07       George  66.276626  ...  14.219533  18.582771       87.021849
7         S08       Hareez   5.302984  ...  43.980951  54.410098       74.530018
8         S09         Ivan   5.777530  ...  94.559212  38.355867       90.483635
9         S10         John  30.968731  ...   3.312853  79.916094       32.706891
10        S11       Kelvin  40.219985  ...  16.826141   7.462064       34.449110
11        S12          Lia  95.928421  ...  95.440164  43.520213       71.930382
12        S13        Maria   8.215446  ...  16.518147  36.543154       80.665074
13        S14         Noel  72.833673  ...  22.089014  52.867757       20.583259
14        S15       Oliver   5.982402  ...  40.977224  80.925749       83.312063
15        S16        Peter  40.694327  ...   8.149884  13.852098       74.528425
16        S17          Roy  43.559963  ...  13.924531  71.306738        8.432155
18        S19        Suvin  72.218179  ...  32.555060  47.007177       83.344403
19        S20          Tan  18.070264  ...   2.618987  14.067349       82.802787

[19 rows x 7 columns]

In [46]:
# Index column can be changed by giving the name of the column - unique and case-sensitive

marks = pd.read_csv('marks.csv', index_col='Student_ID')  # could have given the index no. of the columns (0,1..) as well.
display(marks)

           Student_Name    English  ...    History  Social_Studies
Student_ID                          ...
S01               Alice  96.874050  ...  59.690510       61.373070
S02                 Bob   5.462131  ...  45.664012       80.805730
S03             Charlie  60.753099  ...  24.281512       58.057612
S04               David  21.160844  ...  62.865185       95.264572
S05              Edward  63.250994  ...  60.505272       34.041671
S06               Fysal  42.694748  ...  33.784399       85.019761
S07              George  66.276626  ...  18.582771       87.021849
S08              Hareez   5.302984  ...  54.410098       74.530018
S09                Ivan   5.777530  ...  38.355867       90.483635
S10                John  30.968731  ...  79.916094       32.706891
S11              Kelvin  40.219985  ...   7.462064       34.449110
S12                 Lia  95.928421  ...  43.520213       71.930382
S13               Maria   8.215446  ...  36.543154       80.665074
S14                Noel  72.833673  ...  52.867757       20.583259
S15              Oliver   5.982402  ...  80.925749       83.312063
S16               Peter  40.694327  ...  13.852098       74.528425
S17                 Roy  43.559963  ...  71.306738        8.432155
S18                 Ria  30.830802  ...  78.727155        7.305670
S19               Suvin  72.218179  ...  47.007177       83.344403
S20                 Tan  18.070264  ...  14.067349       82.802787

[20 rows x 6 columns]

Displaying range of indices using .loc and .iloc

Note:
1. In .loc, all value are included
2. In .iloc, the upper range is excluded

Execute the next codes to understand it better.

In [50]:
display(marks.iloc[1:10]) # Range of values. Includes all values/labels.

# .loc is different than .iloc
# .loc is label-based. We need to SPECIFY the VALUE of the index. The values must be there in the index column.

           Student_Name    English  ...    History  Social_Studies
Student_ID                          ...
S02                 Bob   5.462131  ...  45.664012       80.805730
S03             Charlie  60.753099  ...  24.281512       58.057612
S04               David  21.160844  ...  62.865185       95.264572
S05              Edward  63.250994  ...  60.505272       34.041671
S06               Fysal  42.694748  ...  33.784399       85.019761
S07              George  66.276626  ...  18.582771       87.021849
S08              Hareez   5.302984  ...  54.410098       74.530018
S09                Ivan   5.777530  ...  38.355867       90.483635
S10                John  30.968731  ...  79.916094       32.706891

[9 rows x 6 columns]

In [51]:
'''
iloc is integer index-based. 
So here, we have to specify rows and columns by their integer index.
'''
display(marks.iloc[0:10]) # IMPORTANT - Out of 11 indices, the last one will be excluded.

# Returns output of the indices without matching the value of incides entered and the value in the column.
# iloc will not work if the indices are not integers.

           Student_Name    English  ...    History  Social_Studies
Student_ID                          ...
S01               Alice  96.874050  ...  59.690510       61.373070
S02                 Bob   5.462131  ...  45.664012       80.805730
S03             Charlie  60.753099  ...  24.281512       58.057612
S04               David  21.160844  ...  62.865185       95.264572
S05              Edward  63.250994  ...  60.505272       34.041671
S06               Fysal  42.694748  ...  33.784399       85.019761
S07              George  66.276626  ...  18.582771       87.021849
S08              Hareez   5.302984  ...  54.410098       74.530018
S09                Ivan   5.777530  ...  38.355867       90.483635
S10                John  30.968731  ...  79.916094       32.706891

[10 rows x 6 columns]

In [52]:
# What will be the output here? First think of the answer and then run the code.

display(marks.iloc['S04'])

# What is the issue?

TypeError: ignored

In [54]:
# Correct the issue of the previous code cell and write the correct syntax here.
display(marks.loc['S04'])

Student_Name        David
English           21.1608
Maths              95.053
Science           35.8609
History           62.8652
Social_Studies    95.2646
Name: S04, dtype: object

In [55]:
# Data of multiple and non-consecuitive indices
# Selecting details of the 1st and 5th row
display(marks.iloc[[0, 4]])

           Student_Name    English  ...    History  Social_Studies
Student_ID                          ...
S01               Alice  96.874050  ...  59.690510       61.373070
S05              Edward  63.250994  ...  60.505272       34.041671

[2 rows x 6 columns]

In [61]:
# TO DO: Print the details from 0th, 5th and 8th rows, along with the details of indices 4th, 11th and 16th.
display(marks.iloc[[0,3,4,7,10,15]])

           Student_Name    English  ...    History  Social_Studies
Student_ID                          ...
S01               Alice  96.874050  ...  59.690510       61.373070
S04               David  21.160844  ...  62.865185       95.264572
S05              Edward  63.250994  ...  60.505272       34.041671
S08              Hareez   5.302984  ...  54.410098       74.530018
S11              Kelvin  40.219985  ...   7.462064       34.449110
S16               Peter  40.694327  ...  13.852098       74.528425

[6 rows x 6 columns]

In [56]:
# .loc can be used to fetch details from a range of index values in a sequence.

display(marks.loc['S01':'S05'])   # Continuous series of the indices based on label.

           Student_Name    English  ...    History  Social_Studies
Student_ID                          ...
S01               Alice  96.874050  ...  59.690510       61.373070
S02                 Bob   5.462131  ...  45.664012       80.805730
S03             Charlie  60.753099  ...  24.281512       58.057612
S04               David  21.160844  ...  62.865185       95.264572
S05              Edward  63.250994  ...  60.505272       34.041671

[5 rows x 6 columns]

In [64]:
# Run these line one by one and observe the output to notice the difference and execution of the syntax

display(marks.iloc[2:5])
display(marks.iloc[0:5])
display(marks.iloc[:5])
display(marks.iloc[15:20])
display(marks.iloc[15:])
display(marks.iloc[15:100])
display(marks.iloc[:])

           Student_Name    English  ...    History  Social_Studies
Student_ID                          ...
S03             Charlie  60.753099  ...  24.281512       58.057612
S04               David  21.160844  ...  62.865185       95.264572
S05              Edward  63.250994  ...  60.505272       34.041671

[3 rows x 6 columns]

           Student_Name    English  ...    History  Social_Studies
Student_ID                          ...
S01               Alice  96.874050  ...  59.690510       61.373070
S02                 Bob   5.462131  ...  45.664012       80.805730
S03             Charlie  60.753099  ...  24.281512       58.057612
S04               David  21.160844  ...  62.865185       95.264572
S05              Edward  63.250994  ...  60.505272       34.041671

[5 rows x 6 columns]

           Student_Name    English  ...    History  Social_Studies
Student_ID                          ...
S01               Alice  96.874050  ...  59.690510       61.373070
S02                 Bob   5.462131  ...  45.664012       80.805730
S03             Charlie  60.753099  ...  24.281512       58.057612
S04               David  21.160844  ...  62.865185       95.264572
S05              Edward  63.250994  ...  60.505272       34.041671

[5 rows x 6 columns]

           Student_Name    English  ...    History  Social_Studies
Student_ID                          ...
S16               Peter  40.694327  ...  13.852098       74.528425
S17                 Roy  43.559963  ...  71.306738        8.432155
S18                 Ria  30.830802  ...  78.727155        7.305670
S19               Suvin  72.218179  ...  47.007177       83.344403
S20                 Tan  18.070264  ...  14.067349       82.802787

[5 rows x 6 columns]

           Student_Name    English  ...    History  Social_Studies
Student_ID                          ...
S16               Peter  40.694327  ...  13.852098       74.528425
S17                 Roy  43.559963  ...  71.306738        8.432155
S18                 Ria  30.830802  ...  78.727155        7.305670
S19               Suvin  72.218179  ...  47.007177       83.344403
S20                 Tan  18.070264  ...  14.067349       82.802787

[5 rows x 6 columns]

           Student_Name    English  ...    History  Social_Studies
Student_ID                          ...
S16               Peter  40.694327  ...  13.852098       74.528425
S17                 Roy  43.559963  ...  71.306738        8.432155
S18                 Ria  30.830802  ...  78.727155        7.305670
S19               Suvin  72.218179  ...  47.007177       83.344403
S20                 Tan  18.070264  ...  14.067349       82.802787

[5 rows x 6 columns]

           Student_Name    English  ...    History  Social_Studies
Student_ID                          ...
S01               Alice  96.874050  ...  59.690510       61.373070
S02                 Bob   5.462131  ...  45.664012       80.805730
S03             Charlie  60.753099  ...  24.281512       58.057612
S04               David  21.160844  ...  62.865185       95.264572
S05              Edward  63.250994  ...  60.505272       34.041671
S06               Fysal  42.694748  ...  33.784399       85.019761
S07              George  66.276626  ...  18.582771       87.021849
S08              Hareez   5.302984  ...  54.410098       74.530018
S09                Ivan   5.777530  ...  38.355867       90.483635
S10                John  30.968731  ...  79.916094       32.706891
S11              Kelvin  40.219985  ...   7.462064       34.449110
S12                 Lia  95.928421  ...  43.520213       71.930382
S13               Maria   8.215446  ...  36.543154       80.665074
S14                Noel  72.833673  ...  52.867757       20.583259
S15              Oliver   5.982402  ...  80.925749       83.312063
S16               Peter  40.694327  ...  13.852098       74.528425
S17                 Roy  43.559963  ...  71.306738        8.432155
S18                 Ria  30.830802  ...  78.727155        7.305670
S19               Suvin  72.218179  ...  47.007177       83.344403
S20                 Tan  18.070264  ...  14.067349       82.802787

[20 rows x 6 columns]

In [ ]:
# TO DO: Copy paste the above codes and explain the output for each syntax as comments as per given example.
# Example: display(marks.iloc[[3:5]])  # Prints all values from all columns for indices 2, 3 and 4.

display(marks.iloc[2:5])  # Prints all values from all columns for indices 1,2,3 and 4
display(marks.iloc[0:5])  # Print all values from all columns for indices 0 to 4
display(marks.iloc[:5])   # Print all values from all columns for indices between 0 to 4
display(marks.iloc[15:20]) # Print all values from all columns for indices between 14 to 19
display(marks.iloc[15:])  # Print all values from all columns for indices including 14 onwards all
display(marks.iloc[15:100]) # Print all values from all columns for indices between 14 to 99
display(marks.iloc[:])  # Print all values from all columns for all indices

# Data cleaning : Empty value treatment iin dataframes

In [65]:
temps = pd.DataFrame({"sequence":[1,2,3,4,5],
          "measurement_type":['actual','actual','actual',None,'estimated'],  # With strings, it will become 'None'
          "temperature_f":[67.24,84.56,91.61,None,49.64]   #With numbers, it will become 'NaN'
         })
temps

   sequence measurement_type  temperature_f
0         1           actual          67.24
1         2           actual          84.56
2         3           actual          91.61
3         4             None            NaN
4         5        estimated          49.64

NaN belongs to the class float

None belongs to the class NoneType

https://medium.com/analytics-vidhya/dealing-with-missing-values-nan-and-none-in-python-6fc9b8fb4f31

In [66]:
# To identify the null value. Return true if the value is null otherwise false
temps.isna()

   sequence  measurement_type  temperature_f
0     False             False          False
1     False             False          False
2     False             False          False
3     False              True           True
4     False             False          False

In [67]:
# Return the count of missing value from each column     
temps.isna().sum()

sequence            0
measurement_type    1
temperature_f       1
dtype: int64

In [68]:
# Total count of null from all columns
temps.isna().sum().sum()

2

In [69]:
# Drop/delete the row containing missing values

clean_temps = temps.dropna(how='any')  # how: {'any', 'all'}. Default 'any'
display (clean_temps)

# ‘any’ : If any NA values are present, drop that row or column.
# ‘all’ : If all values are NA, drop that row or column.


# Observe, in the output, index 3 is not there.

   sequence measurement_type  temperature_f
0         1           actual          67.24
1         2           actual          84.56
2         3           actual          91.61
4         5        estimated          49.64

In [70]:
# TO DO:  Copy paste the codes from the above cell, change the 'how' argument as 'all' and observe the difference in output.
clean_temps = temps.dropna(how='all')  
display (clean_temps)

   sequence measurement_type  temperature_f
0         1           actual          67.24
1         2           actual          84.56
2         3           actual          91.61
3         4             None            NaN
4         5        estimated          49.64

In [71]:
# Drop the ROWS where at least one element is missing.
temps.dropna()

   sequence measurement_type  temperature_f
0         1           actual          67.24
1         2           actual          84.56
2         3           actual          91.61
4         5        estimated          49.64

In [72]:
# Drop COLUMNS where there are missing values.

# Drop the columns where at least one element is missing.
temps.dropna(axis = 'columns') # Without the 'axis' argument, rows will be dropped by default as you did in the previous code.

   sequence
0         1
1         2
2         3
3         4
4         5

##### Handling missing data by replacing values

Not every time we should delete the missing values, especially when the dataset is smaller or when missing values are very significant. In such as case, additional data-preparation is performed.

Depending on the dataset, it's structure and the research questions, we should decide which data preparation technique should be applied on what column or missing values.

In [73]:
temps['temperature_f'].cumsum()   # Returns the commulative sum. 

# It will skip null values. skipna = TRUE by default

# CAN YOU THINK OF ANY PRACTICAL USE OF cumsum() ?

0     67.24
1    151.80
2    243.41
3       NaN
4    293.05
Name: temperature_f, dtype: float64

In [74]:
temps['temperature_f'].cumsum(skipna=False)

0     67.24
1    151.80
2    243.41
3       NaN
4       NaN
Name: temperature_f, dtype: float64

In [75]:
# fill missing value with zero
temps.fillna(value=0, inplace = True)   # Do you remember the use of inplace? If not, please scroll up and check.
display(temps)

   sequence measurement_type  temperature_f
0         1           actual          67.24
1         2           actual          84.56
2         3           actual          91.61
3         4                0           0.00
4         5        estimated          49.64

In [81]:
# Print the dataframe

temps

# Why 0 in last column is 0.00 while only 0 in measurement_type? Please explain as a comment in this cell.
# Data type of column temperature_f is 'float' hence 0 in last column is 0.00 and data type of column measurement_type is 'str' hence only 0 in this column

   sequence measurement_type  temperature_f
0         1           actual          67.24
1         2           actual          84.56
2         3           actual          91.61
3         4                0           0.00
4         5        estimated          49.64

In [82]:
# fill missing value with previous value
temps = pd.DataFrame({"sequence":[1,2,3,4,5],
          "measurement_type":['actual','actual','actual',None,'estimated'],
          "temperature_f":[67.24,84.56,91.61,None,49.64]
         })
temps.fillna(method='pad' , inplace=True)  # 'pad' means padding. Take value from previous row
temps

   sequence measurement_type  temperature_f
0         1           actual          67.24
1         2           actual          84.56
2         3           actual          91.61
3         4           actual          91.61
4         5        estimated          49.64

In [83]:
# fill missing value with next value
temps1 = pd.DataFrame({"sequence":[1,2,3,4,5],
          "measurement_type":['actual','actual','actual',None,'estimated'],
          "temperature_f":[67.24,84.56,91.61,None,49.64]
         })
temps1.fillna(method='bfill' , inplace=True)  # bfill takes next value to replace
temps1

   sequence measurement_type  temperature_f
0         1           actual          67.24
1         2           actual          84.56
2         3           actual          91.61
3         4        estimated          49.64
4         5        estimated          49.64

In [84]:
# fill missing value with mean
temps = pd.DataFrame({"sequence":[1,2,3,4,5],
          "measurement_type":['actual','actual','actual',None,'estimated'],
          "temperature_f":[67.24,84.56,91.61,None,49.64]
         })
temps['temperature_f'].fillna(temps['temperature_f'].mean(), inplace=True)  # Mean will not work on strings
temps

   sequence measurement_type  temperature_f
0         1           actual        67.2400
1         2           actual        84.5600
2         3           actual        91.6100
3         4             None        73.2625
4         5        estimated        49.6400

# Lambda Function

In [85]:
# lambda is used to define a temporary expression without any return statement. It always contains an expression
# that is returned. There is no need to assign a variable with lambda.


def cube(y):
    return y*y*y  # return is a keyword. Python stops when the code reaches to return statement. Print is a function.
    

# using the normally defined function
    print(cube(5))
 
# using the lambda function                 # Why this is red? How to resolve it?
lambda_cube = lambda y: y*y*y
print(lambda_cube(5))

125

In [86]:
# Creating new dataframe to explore the use of Lambda and changing indices.

teams = pd.DataFrame({"Region":['North','West','East','South'],
          "Team":['One','Two','One','Two'],
          "Squad":['A','B','C','D'],
          "Revenue":[7500,5500,2750,6400],
            "Cost":[5200,5100,4400,5300]})

display (teams)

  Region Team Squad  Revenue  Cost
0  North  One     A     7500  5200
1   West  Two     B     5500  5100
2   East  One     C     2750  4400
3  South  Two     D     6400  5300

In [87]:
# apply() to alter values along an axis in your dataframe or in a series/column 

# Categorise based on the revenue and cost
teams['Profit'] = teams.apply(lambda x: 'Profit' if x['Revenue']>x['Cost'] else 'Loss',axis=1)
teams

  Region Team Squad  Revenue  Cost  Profit
0  North  One     A     7500  5200  Profit
1   West  Two     B     5500  5100  Profit
2   East  One     C     2750  4400    Loss
3  South  Two     D     6400  5300  Profit

In [88]:
# Use map() to substitute each value in a series
team_map = {"One":"Red","Two":"Blue"}      # new variable - dictionary (key-value pair)
teams['Team Color'] = teams['Team'].map(team_map) # A new column with mapped values
teams

  Region Team Squad  Revenue  Cost  Profit Team Color
0  North  One     A     7500  5200  Profit        Red
1   West  Two     B     5500  5100  Profit       Blue
2   East  One     C     2750  4400    Loss        Red
3  South  Two     D     6400  5300  Profit       Blue

In [89]:
# applymap() method do elementwise operation on the entire dataframe.
# This method applies a function that accepts and returns a scalar to every element of a DataFrame.

teams.applymap(lambda x: len(str(x)))  # int(x) won't work because data has strings which can not be convereted to int.

   Region  Team  Squad  Revenue  Cost  Profit  Team Color
0       5     3      1        4     4       6           3
1       4     3      1        4     4       6           4
2       4     3      1        4     4       4           3
3       5     3      1        4     4       6           4

In [90]:
# Grouping on different categories. Needs the category as well as parameter
teams.groupby(['Profit']).max()

       Region Team Squad  Revenue  Cost Team Color
Profit
Loss     East  One     C     2750  4400        Red
Profit   West  Two     D     7500  5300        Red

In [91]:
# TO DO: Can you group the records on Cost with minimum values?
teams.groupby(['Cost']).min()

     Region Team Squad  Revenue  Profit Team Color
Cost
4400   East  One     C     2750    Loss        Red
5100   West  Two     B     5500  Profit       Blue
5200  North  One     A     7500  Profit        Red
5300  South  Two     D     6400  Profit       Blue

In [92]:
# TO DO: Can you group the records on Revenue column with mean values?
teams.groupby(['Revenue']).mean()

         Cost
Revenue
2750     4400
5500     5100
6400     5300
7500     5200

In [93]:
# Grouping on the basis of aggregates
teams.groupby(['Team']).agg({'Revenue':['mean','min','max']})

     Revenue
        mean   min   max
Team
One     5125  2750  7500
Two     5950  5500  6400

Reset Index, Set Index and ReIndexing

In [94]:
# TO DO: Copy-paste the copy from earlier to redefine teams dataframe, and display it
teams

  Region Team Squad  Revenue  Cost  Profit Team Color
0  North  One     A     7500  5200  Profit        Red
1   West  Two     B     5500  5100  Profit       Blue
2   East  One     C     2750  4400    Loss        Red
3  South  Two     D     6400  5300  Profit       Blue

In [95]:
# Setting two columns as index when a single column has not unique values.

teams_reindex = teams.set_index(['Region','Team'])  # 2 indices. useful when values are not unique
display(teams)

print()    # TO print blank/new line.


display(teams_reindex)

  Region Team Squad  Revenue  Cost  Profit Team Color
0  North  One     A     7500  5200  Profit        Red
1   West  Two     B     5500  5100  Profit       Blue
2   East  One     C     2750  4400    Loss        Red
3  South  Two     D     6400  5300  Profit       Blue

            Squad  Revenue  Cost  Profit Team Color
Region Team
North  One      A     7500  5200  Profit        Red
West   Two      B     5500  5100  Profit       Blue
East   One      C     2750  4400    Loss        Red
South  Two      D     6400  5300  Profit       Blue

In [96]:
# Restructuring the dataframe based the multiple indices
stacked = pd.DataFrame(teams_reindex.stack())
stacked

                             0
Region Team
North  One  Squad            A
            Revenue       7500
            Cost          5200
            Profit      Profit
            Team Color     Red
West   Two  Squad            B
            Revenue       5500
            Cost          5100
            Profit      Profit
            Team Color    Blue
East   One  Squad            C
            Revenue       2750
            Cost          4400
            Profit        Loss
            Team Color     Red
South  Two  Squad            D
            Revenue       6400
            Cost          5300
            Profit      Profit
            Team Color    Blue

# Mergining dataframes

We are going to learn how to merge multiple dataframes based on left, right and inner join.

Read about merging: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html

In [97]:
# Defining two new dataframes
group1 = pd.DataFrame({'name': ['Alice', 'Bob', 'Charlie', 'David'],
                    'number': [1, 2, 3, 4]})
group2 = pd.DataFrame({'name': ['Charlie', 'David', 'Edward', 'Ford'],
                    'number': [3, 4, 5, 6]})

In [98]:
group1.merge(group2,how='left', on='number')   # Left - all from 1st table and only common from 2nd table.

# Notice the NAN or empty values.

    name_x  number   name_y
0    Alice       1      NaN
1      Bob       2      NaN
2  Charlie       3  Charlie
3    David       4    David

In [99]:
group1.merge(group2)   # Shows only the common records.

      name  number
0  Charlie       3
1    David       4

In [100]:
group1.merge(group2,how='inner',left_on='number',right_on='number')  # Inner - Shows only the common records

# Why there are no null values now in the output? Answer as a comment.

    name_x  number   name_y
0  Charlie       3  Charlie
1    David       4    David

In [101]:
group1.merge(group2,how='right',left_on='number',right_on='number')  # Right - All from 2nd table, common from 1st table.

    name_x  number   name_y
0  Charlie       3  Charlie
1    David       4    David
2      NaN       5   Edward
3      NaN       6     Ford

# Matplotlib library in Python

Matplotlib is a plotting library for the Python programming language. Matplotlib in Python is used as it is a robust, free and easy library for data visualization.

Read more on matplotlib: 
1. https://matplotlib.org/
2. https://www.w3schools.com/python/matplotlib_intro.asp

Another important library - seaborn - is use for statistical data visualization.

1. https://seaborn.pydata.org/ 
2. https://www.jigsawacademy.com/blogs/ai-ml/seaborn-vs-matplotlib/#Difference-between-seaborn-vs-matplotlib

Next, we will explore some data visualization using Matplotlib. After finishing it, please visit [MatPlotLib on W3Schools](https://www.w3schools.com/python/matplotlib_intro.asp) for additional practise.

#### Reading: Plotting charts in Matplotlib

1. Creating basic charts: https://drive.google.com/file/d/1kunIRcTiUWbJp_DZRcmlmIZMh3ua_yIK/view?usp=sharing
2. Customizing our charts: https://drive.google.com/file/d/1fuYY9DfhtmekoDCCX_HDfItrObJhKpGA/view?usp=sharing

The next codes are exercises only. Please make sure you have gone through the above shared documents/readings before proceeding further. What concepts and syntax you learnt will be used in the next exercises.

Dataset: https://drive.google.com/file/d/1Za1B2Nt_VuEDrSznS6PN5BM4c0pEOQm5/view?usp=sharing

In [ ]:
# TO DO : Read the instructions and write the codes.
'''
Get the data

Open mtcars.csv in Excel or Text dataset and have a look at the data. Understand the variables.

You can also open in Google drive to view it however, make sure you download it in your local system and upload in 
Jupyter Notebook folder where you have the Python file.
'''

In [ ]:
# TO DO: 
# Import pandas package as pd

# Use function pd.read_csv to upload mtcars.csv by using either of two methods below:
    # Use_cols ( all the columns except car_names )
    # Index_col = car_names ( expected output as below)

# display the dataframe

In [ ]:
# Import he required package 
import matplotlib.pyplot as plt

In [ ]:
# TO DO : Create a scatter plot with mpg and hp by providing xlabel and ylabel

In [ ]:
# TO DO: Change the color to red in the previous code

In [ ]:
# TO DO: Create crosstab for cyl(cylinder) and columns as count

# A cross-tabulation (or crosstab) is a two- (or more) dimensional table that records the number (frequency) of 
# respondents that have the specific characteristics described in the cells of the table.

In [ ]:
# Other way to create the crosstab
import numpy as np 
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

ct = pd.crosstab(df.cyl, df.cyl)

ct.plot.bar(stacked=True)    # Try staked=False and then by removing stakced part
plt.legend(title='mark')   # Optional

plt.show()

In [ ]:
# TO DO: Create crosstab for cyl(cylinder) and am as 'ct2' and create a bar plot

# Reading reference: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html

In [ ]:
# TO DO: Create groupby (cyl) to visualize mpg and hp in a bar chart
# Hint: Use nunique()

In [ ]:
# TO DO: Create a pie chart for cyl count

In [ ]:
# TO DO: Create a Histogram for MPG column
# Reading: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.plot.hist.html